config/Catalogs/АтрибутыИнкассации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АтрибутыИнкассации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДебета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПоступленияДляИнкассации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОриентацияОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчетныйСчетБанкаВносителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеPIN</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИспользованиеPINДляИнкассации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/АтрибутыИнкассации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если НЕ РассчетныйСчет.Владелец = Поставщик Тогда
		#Если Клиент Тогда
			Предупреждение("Контрагент: " + Поставщик + " не является владельцем выбранного рассчетного счета. Запись элемента отменена.");	
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ РассчетныйСчетБанкаВносителя.Владелец = Поставщик Тогда
		#Если Клиент Тогда
			Предупреждение("Контрагент: " + Поставщик + " не является владельцем выбранного рассчетного счета банка вносителя. Запись элемента отменена.");	
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры
